7767517
145 161
Input            input                    0 1 input
Convolution      Conv_0                   1 1 input 613 0=24 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=648
ReLU             Relu_1                   1 1 613 341
Pooling          MaxPool_2                1 1 341 342 0=0 1=3 11=3 2=2 12=2 3=1 13=1 14=1 15=1 5=1
Split            splitncnn_0              1 2 342 342_splitncnn_0 342_splitncnn_1
ConvolutionDepthWise Conv_3                   1 1 342_splitncnn_1 616 0=24 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=216 7=24
Convolution      Conv_4                   1 1 616 619 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             Relu_5                   1 1 619 347
Convolution      Conv_6                   1 1 342_splitncnn_0 622 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             Relu_7                   1 1 622 350
ConvolutionDepthWise Conv_8                   1 1 350 625 0=24 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=216 7=24
Convolution      Conv_9                   1 1 625 628 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             Relu_10                  1 1 628 355
Concat           Concat_11                2 1 347 355 356 0=0
ShuffleChannel   Reshape_16               1 1 356 361 0=2 1=0
Slice            Split_17                 1 2 361 362 363 -23300=2,24,-233 1=0
Convolution      Conv_18                  1 1 363 631 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             Relu_19                  1 1 631 366
ConvolutionDepthWise Conv_20                  1 1 366 634 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=216 7=24
Convolution      Conv_21                  1 1 634 637 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             Relu_22                  1 1 637 371
Concat           Concat_23                2 1 362 371 372 0=0
ShuffleChannel   Reshape_28               1 1 372 377 0=2 1=0
Slice            Split_29                 1 2 377 378 379 -23300=2,24,-233 1=0
Convolution      Conv_30                  1 1 379 640 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             Relu_31                  1 1 640 382
ConvolutionDepthWise Conv_32                  1 1 382 643 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=216 7=24
Convolution      Conv_33                  1 1 643 646 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             Relu_34                  1 1 646 387
Concat           Concat_35                2 1 378 387 388 0=0
ShuffleChannel   Reshape_40               1 1 388 393 0=2 1=0
Slice            Split_41                 1 2 393 394 395 -23300=2,24,-233 1=0
Convolution      Conv_42                  1 1 395 649 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             Relu_43                  1 1 649 398
ConvolutionDepthWise Conv_44                  1 1 398 652 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=216 7=24
Convolution      Conv_45                  1 1 652 655 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
ReLU             Relu_46                  1 1 655 403
Concat           Concat_47                2 1 394 403 404 0=0
ShuffleChannel   Reshape_52               1 1 404 409 0=2 1=0
Split            splitncnn_1              1 2 409 409_splitncnn_0 409_splitncnn_1
ConvolutionDepthWise Conv_53                  1 1 409_splitncnn_1 658 0=48 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      Conv_54                  1 1 658 661 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_55                  1 1 661 414
Convolution      Conv_56                  1 1 409_splitncnn_0 664 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_57                  1 1 664 417
ConvolutionDepthWise Conv_58                  1 1 417 667 0=48 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      Conv_59                  1 1 667 670 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_60                  1 1 670 422
Concat           Concat_61                2 1 414 422 423 0=0
ShuffleChannel   Reshape_66               1 1 423 428 0=2 1=0
Slice            Split_67                 1 2 428 429 430 -23300=2,48,-233 1=0
Convolution      Conv_68                  1 1 430 673 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_69                  1 1 673 433
ConvolutionDepthWise Conv_70                  1 1 433 676 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      Conv_71                  1 1 676 679 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_72                  1 1 679 438
Concat           Concat_73                2 1 429 438 439 0=0
ShuffleChannel   Reshape_78               1 1 439 444 0=2 1=0
Slice            Split_79                 1 2 444 445 446 -23300=2,48,-233 1=0
Convolution      Conv_80                  1 1 446 682 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_81                  1 1 682 449
ConvolutionDepthWise Conv_82                  1 1 449 685 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      Conv_83                  1 1 685 688 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_84                  1 1 688 454
Concat           Concat_85                2 1 445 454 455 0=0
ShuffleChannel   Reshape_90               1 1 455 460 0=2 1=0
Slice            Split_91                 1 2 460 461 462 -23300=2,48,-233 1=0
Convolution      Conv_92                  1 1 462 691 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_93                  1 1 691 465
ConvolutionDepthWise Conv_94                  1 1 465 694 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      Conv_95                  1 1 694 697 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_96                  1 1 697 470
Concat           Concat_97                2 1 461 470 471 0=0
ShuffleChannel   Reshape_102              1 1 471 476 0=2 1=0
Slice            Split_103                1 2 476 477 478 -23300=2,48,-233 1=0
Convolution      Conv_104                 1 1 478 700 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_105                 1 1 700 481
ConvolutionDepthWise Conv_106                 1 1 481 703 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      Conv_107                 1 1 703 706 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_108                 1 1 706 486
Concat           Concat_109               2 1 477 486 487 0=0
ShuffleChannel   Reshape_114              1 1 487 492 0=2 1=0
Slice            Split_115                1 2 492 493 494 -23300=2,48,-233 1=0
Convolution      Conv_116                 1 1 494 709 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_117                 1 1 709 497
ConvolutionDepthWise Conv_118                 1 1 497 712 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      Conv_119                 1 1 712 715 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_120                 1 1 715 502
Concat           Concat_121               2 1 493 502 503 0=0
ShuffleChannel   Reshape_126              1 1 503 508 0=2 1=0
Slice            Split_127                1 2 508 509 510 -23300=2,48,-233 1=0
Convolution      Conv_128                 1 1 510 718 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_129                 1 1 718 513
ConvolutionDepthWise Conv_130                 1 1 513 721 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      Conv_131                 1 1 721 724 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_132                 1 1 724 518
Concat           Concat_133               2 1 509 518 519 0=0
ShuffleChannel   Reshape_138              1 1 519 524 0=2 1=0
Slice            Split_139                1 2 524 525 526 -23300=2,48,-233 1=0
Convolution      Conv_140                 1 1 526 727 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_141                 1 1 727 529
ConvolutionDepthWise Conv_142                 1 1 529 730 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      Conv_143                 1 1 730 733 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
ReLU             Relu_144                 1 1 733 534
Concat           Concat_145               2 1 525 534 535 0=0
ShuffleChannel   Reshape_150              1 1 535 540 0=2 1=0
Split            splitncnn_2              1 2 540 540_splitncnn_0 540_splitncnn_1
ConvolutionDepthWise Conv_151                 1 1 540_splitncnn_1 736 0=96 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=864 7=96
Convolution      Conv_152                 1 1 736 739 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             Relu_153                 1 1 739 545
Convolution      Conv_154                 1 1 540_splitncnn_0 742 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             Relu_155                 1 1 742 548
ConvolutionDepthWise Conv_156                 1 1 548 745 0=96 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=864 7=96
Convolution      Conv_157                 1 1 745 748 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             Relu_158                 1 1 748 553
Concat           Concat_159               2 1 545 553 554 0=0
ShuffleChannel   Reshape_164              1 1 554 559 0=2 1=0
Slice            Split_165                1 2 559 560 561 -23300=2,96,-233 1=0
Convolution      Conv_166                 1 1 561 751 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             Relu_167                 1 1 751 564
ConvolutionDepthWise Conv_168                 1 1 564 754 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864 7=96
Convolution      Conv_169                 1 1 754 757 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             Relu_170                 1 1 757 569
Concat           Concat_171               2 1 560 569 570 0=0
ShuffleChannel   Reshape_176              1 1 570 575 0=2 1=0
Slice            Split_177                1 2 575 576 577 -23300=2,96,-233 1=0
Convolution      Conv_178                 1 1 577 760 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             Relu_179                 1 1 760 580
ConvolutionDepthWise Conv_180                 1 1 580 763 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864 7=96
Convolution      Conv_181                 1 1 763 766 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             Relu_182                 1 1 766 585
Concat           Concat_183               2 1 576 585 586 0=0
ShuffleChannel   Reshape_188              1 1 586 591 0=2 1=0
Slice            Split_189                1 2 591 592 593 -23300=2,96,-233 1=0
Convolution      Conv_190                 1 1 593 769 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             Relu_191                 1 1 769 596
ConvolutionDepthWise Conv_192                 1 1 596 772 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864 7=96
Convolution      Conv_193                 1 1 772 775 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
ReLU             Relu_194                 1 1 775 601
Concat           Concat_195               2 1 592 601 602 0=0
ShuffleChannel   Reshape_200              1 1 602 607 0=2 1=0
Convolution      Conv_201                 1 1 607 778 0=1024 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=196608
ReLU             Relu_202                 1 1 778 610
Reduction        ReduceMean_203           1 1 610 611 0=3 1=0 -23303=2,2,3 4=0
InnerProduct     Gemm_204                 1 1 611 output 0=5 1=1 2=5120
